---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateCircuitTableForInstance(Autodesk.Revit.DB.FamilyInstance)
source: html/617774de-9234-6347-051d-203cdf8172ed.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateCircuitTableForInstance Method

Redraw the circuit table for the given panel with the given parameter updates

## Syntax (C#)
```csharp
public void UpdateCircuitTableForInstance(
	FamilyInstance pPanel
)
```

## Parameters
- **pPanel** (`Autodesk.Revit.DB.FamilyInstance`) - The panel that this circuit table is being drawn for

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null